const products = [
  {
    id: 1,
    name: "Продукт 1",
    price: 199,
    image: "https://pulsefit.bg/uploads/tinymce/58069.jpg",
    description: `Пътеката за бягане е предназначена за взискателни спортисти, които търсят продукт с
много добри характеристики, който е лесен за съхранение. Тя е предназначена за
редовно използване и може да се сгъва, за да пести място при съхранение.`,
    type: "cardio",
  },
  {
    id: 2,
    name: "Продукт 2",
    price: 299,
    image:
      "https://jkfitness.bg/image/cache/catalog/TOORX/Kombiniran-fitnes-ured-MSX-50-TOORX-jkfitness.bg%20(6)-900x900.jpg",
    description: `Комбиниран фитнес уред , предназначена за тренировки в домашни условия или в
хотелски фитнес центрове. На комплексния тренажор могат да се изпълнява голям
арсенал от силови упражнения за всички мускулни групи на човешкото тяло. Компактна
и удобна и в същото време позволява да се провеждат качествени тренировки, поради
възможността от силозадаване с пакет от тежести с тегло 70 кг.`,
    type: "strength",
  },
  {
    id: 3,
    name: "Продукт 3",
    price: 399,
    image: "https://frankfurt.apollo.olxcdn.com/v1/files/lmxovp8ho052-BG/image",
    description: `Кростренажорът разполага с LCD дисплей показващ; продължителност на тренировка,
пулс, изгорени калории по време на тренировката. Можете да тренирате по всяко
време, без значение на метеорологичната обстановка, подобрявайки вашата сърдечна
дейност, метаболизъм, развитието на мускулите на краката, както и цялостното ви
физическо здраве.`,
    type: "accessories",
  },
  {
    id: 4,
    name: "Продукт 4",
    price: 499,
    image:
      "https://cdn.technomarket.bg/ng/media/cache/mid_thumb/uploads/marketplace/43/650711-1.jpg.webp",
    description: `Мултифункционалната лежанка е предназначена за хора от всякакъв размер с
променящи се височини и е проектирана да работите с различни лостове. Най-
хубавото от всичко е, че когато приключите за деня, най-добрата фитнес олимпийска
сгъваема лежанка се събира за да не заема място. Бързо сменящият се предпазен
щифт позволява множество настройки на задната подложка, което ви позволява да се
движите плавно и безопасно по време на тренировка. Промяната на ъгъла на наклон
поставя допълнителен стрес върху горната част на гръдните мускули.`,
    type: "cardio",
  },
  {
    id: 5,
    name: "Продукт 5",
    price: 599,
    image:
      "https://cdncloudcart.com/32450/products/images/18955/veloergometar-k-fit-mount-image_6406909b70057_600x600.jpeg?1678151842",
    description: `Велоергометър e фитнес съоръжение, предназначено за използване в дома ви.
Компактен и лек уред от базов клас. Идеален за тренировка в домашни условия както
за деца и подрастващи, така и за възрастни. Подходящ за раздвижване и
рехабилитация след травма. То е с модерен дизайн, а компютърът показва всички
важни параметри по време на тренировка. Регулиране на натоварването, удобна
седалка с регулируема височина, хоризонтално регулируеми дръжки и педали,
гарантиращи приятна и ефективна тренировка в домашни условия.`,
    type: "strength",
  },
  {
    id: 6,
    name: "Продукт 6",
    price: 699,
    image:
      "https://nadaspa.eu/cdn/shop/products/1_5f3c21c4-1727-43b9-9a6e-efe3ea7d78d6_720x1000.jpg?v=1606237369",
    description: `Лежанката е подходяща за тренировка на основните групи мускули. Регулируема
стойка за щанга. Регулиране наклона на облегалката до хоризонтално положение.
Програмата за сила се базира на максималната тежест, с която може да направите 5

повторения (5МП). Всяка тренировка на лежанката е от 5 серии, като във всяка серия
тежестта е с 10% по- голяма от тази в предишната серия. Последната серия е най-
тежка и служи за основа на следващата ви тренировка. Полупрофесионални домашни
фитнес уреди, уреди за фитнес домашни.`,
    type: "accessories",
  },
  {
    id: 7,
    name: "Продукт 7",
    price: 799,
    image: "https://sporti.bg/g/30/komplekt-dambeli-20-kg.webp",
    description: `2 разглобяеми дъмбела по 10кг кг с метални дискове, подходящи за любителски
тренировки в домашна обстановка. Лостчета с включени гайки. Всеки дъмбел се състои
от хромиран лост дълъг 35см ф30 с гайки (2.5кг) и 2 диска по 2.5кг и 2 диска по 1.25кг,
които общо правят 10кг`,
    type: "strength",
  },
  {
    id: 8,
    name: "Продукт 8",
    price: 899,
    image:
      "https://homeco.bg/media/catalog/product/cache/520332c47eb5e742430b01c96310ed79/F/A/FA1002-0.jpg",
    description: `Пудовка 6 кг с широка дръжка за хващане с 1 или 2 ръце за различни видове
упражнения. Корпусът е изработен от висококачествена пластмаса, устойчива на
удари. Пълнежът е от цимент. Ожулванията и драскотините в резултат от интензивни
тренировки, не се виждат на черния фон. Висококачествената, здрава дръжка
гарантира сигурен и удобен захват.`,
    type: "accessories",
  },
  {
    id: 9,
    name: "Продукт 9",
    price: 999,
    image:
      "https://homeco.bg/media/catalog/product/cache/520332c47eb5e742430b01c96310ed79/F/A/FA1002-0.jpg",
    description: `Пудовка 6 кг с широка дръжка за хващане с 1 или 2 ръце за различни видове
упражнения. Корпусът е изработен от висококачествена пластмаса, устойчива на
удари. Пълнежът е от цимент. Ожулванията и драскотините в резултат от интензивни
тренировки, не се виждат на черния фон. Висококачествената, здрава дръжка
гарантира сигурен и удобен захват.`,
    type: "accessories",
  },
];

const promotions = [
  {
    id: 1,
    name: "Фитнес уред",
    discount: 20,
    oldPrice: 200,
    newPrice: 160,
    image:
      "https://beautyandpower.eu/6852-large_default/postelka-za-fitnes-i-joga.jpg",
    description:
      "Удобна постелка за фитнес и йога, подходяща за ежедневна употреба.",
  },
  {
    id: 2,
    name: "Спортни обувки",
    discount: 15,
    oldPrice: 120,
    newPrice: 102,
    image: "path-to-your-image/product2.jpg",
    description:
      "Висококачествени спортни обувки, идеални за тренировки и спорт.",
  },
  {
    id: 3,
    name: "Тренировъчен комплект",
    discount: 17,
    oldPrice: 300,
    newPrice: 250,
    image: "path-to-your-image/product3.jpg",
    description:
      "Комплект за тренировки, включващ необходимото за пълноценна тренировка.",
  },
];

const filters = [
  {
    id: 1,
    predicate: (product) => product.price < 100,
    name: "Под 100 лв.",
    type: "price",
    orderNumber: 1,
  },
  {
    id: 2,
    predicate: (product) => product.price >= 100 && product.price < 500,
    name: "100 - 500 лв.",
    type: "price",
    orderNumber: 2,
  },
  {
    id: 3,
    predicate: (product) => product.price >= 500,
    name: "Над 500 лв.",
    type: "price",
    orderNumber: 3,
  },
  {
    id: 4,
    predicate: (product) => product.type === "accessories",
    name: "Аксесоари",
    type: "type",
    orderNumber: 1,
  },
  {
    id: 5,
    predicate: (product) => product.type === "strength",
    name: "Сила",
    type: "type",
    orderNumber: 2,
  },
  {
    id: 6,
    predicate: (product) => product.type === "cardio",
    name: "Кардио",
    type: "type",
    orderNumber: 3,
  },
];
